const GAME_MODE = {
    SINONIM: "sinonim",
    TRACE: "trace",
    BLITZ:"blitz"
};

const GAME_LEVEL = {
    EASY: "easy_level",
    NORMAL: "normal_level",
    HARD: "hard_level"
}

const RULES = [
    ["./images/game/deer.jpg", "олень", "рога", "зверь"],
    ["./images/game/hunt.jpg", "охотник", "ружье", "человек"],
    ["./images/game/izba.jpg", "изба", "бревна", "дом"],
    ["./images/game/fox.jpg", "лиса", "мех", "хищник"]
  ];

const TEXT_LEVEL1=[
    "Один", "солнечный", "день", "мы", "решили", "отправиться", "в", "путешествие", 
    "на", "зеленую", "луговую", "поляну", "чтобы", "насладиться", "природой", "и", 
    "свежим", "воздухом", "Мы", "взяли", "небольшой", "пикник", "с", "собой", 
    "забыли", "о", "буднях", "и", "погрузились", "в", "мир", "тишины", "и", 
    "спокойствия", "Птицы", "пели", "нам", "свои", "песни", "а", "ветер", 
    "ласкал", "листва", "деревьев", "шелестела", "мирно", "Это", "был", "идеальный", 
    "день", "для", "отдыха"
  ];

  const TEXT_LEVEL2 = [
    "В", "далеком", "царстве", "жил", "мудрый", "старец", "который", "любил", "рассказывать",
    "истории", "Однажды", "он", "собрал", "всех", "жителей", "и", "начал", "свою", "речь",
    "Говорил", "он", "о", "важности", "смеха", "дружбы", "и", "любви", "в", "жизни", "каждого",
    "От", "его", "слов", "люди", "чувствовали", "тепло", "и", "радость", "Смех", "звучал",
    "повсюду", "а", "дети", "играли", "с", "большим", "весельем", "Старец", "продолжал",
    "свою", "мудрую", "проповедь", "рассказывая", "о", "прошлых", "временах", "и", "героях",
    "которые", "совершали", "подвиги", "ради", "своего", "народа", "В", "конце", "встречи",
    "каждый", "понял", "что", "самое", "ценное", "это", "мир", "и", "взаимопонимание",
    "между", "людьми"
  ];

  const TEXT_LEVEL3 = [
    "В", "небольшом", "городке", "на", "окраине", "широкой", "реки", "жили", "люди", 
    "со", "своими", "традициями", "и", "привычками", "Они", "ценили", "общество", "друг", 
    "друга", "и", "собирались", "вместе", "каждую", "неделю", "чтобы", "поделиться", "новостями", 
    "и", "провести", "время", "за", "играми", "и", "разговорами", "Дети", "играли", "во", 
    "дворе", "в", "мяч", "и", "прятки", "а", "взрослые", "обсуждали", "последние", "события", 
    "и", "планы", "на", "будущее", "В", "этом", "городке", "всегда", "царила", "атмосфера", 
    "доброты", "и", "спокойствия", "Жители", "помогали", "друг", "другу", "в", "трудные", 
    "моменты", "и", "всегда", "находили", "время", "для", "участия", "в", "общественной", 
    "жизни", "Этот", "мирный", "уголок", "привлекал", "путешественников", "своей", "гостеприимностью", 
    "и", "красотой", "природы", "Многие", "оставались", "здесь", "на", "долгое", "время", 
    "потому", "что", "находили", "спокойствие", "и", "гармонию", "которых", "им", "не", 
    "хватало", "в", "больших", "городах"
  ];

  const questionsAndAnswers = [
    ["Вечнозеленое дерево хвойное", "Ель", "Дуб", "Сосна",1],
    ["Большое водное млекопетающее", "Тюлень", "Кит", "Слон",2],
    ["Мираж жарко солнце", "Пляж", "Степь", "Пустыня",3],
    ["Мех рыжий хищник", "Лиса", "Лев", "Косуля",1],
    ["6-струн гриф испания", "Гусли", "Гитра", "Уд",2],
    ["Ночь спутник кратер", "Звезды", "Венера", "Луна",3],
    ["Стационарный эвм железо", "Компьютер", "Монитор", "Процессор",1],
    ["Воздух бриз могуч ", "Буря", "Ветер", "Парус",2],
    ["Индия Африка Шахматы", "Король", "Конь", "Слон",3],
    ["Грива подкова всадник", "Конь", "Лев", "Блоха",1]
  ];
const wordsArr = [[
    { num: 0, word: 'Улей' },
    { num: 1, word: 'Окно' },
    { num: 2, word: 'Стул' },
    { num: 3, word: 'Дерево' },
    { num: 4, word: 'Лошадь' },
    { num: 5, word: 'Компьютер' },
    { num: 6, word: 'Птица' },
    { num: 7, word: 'Стакан' },
    { num: 8, word: 'Шкаф' },
    { num: 9, word: 'Салат' },
], [
    { num: 0, word: 'Пчелы' },
    { num: 1, word: 'Рама' },
    { num: 2, word: 'Спинка' },
    { num: 3, word: 'Ветка' },
    { num: 4, word: 'Копыто' },
    { num: 5, word: 'Процессор' },
    { num: 6, word: 'Клюв' },
    { num: 7, word: 'Ручка' },
    { num: 8, word: 'Полка' },
    { num: 9, word: 'Помидор' },
]];
